       >>SOURCE FORMAT FREE
       identification division.
       program-id. working_with_input.
       author. Irfan Ghat.
       date-written.May 23rd
       