       >>SOURCE FORMAT FREE
       identification division.
       program-id. demo.
       author. Irfan Ghat.
       date-written.May 23rd 2024
       environment division.

       data division.
       file section.
       working-storage section.
    
       